fio/fio--large-file-90-pct-write-1-client-12-worker-2018-10-23-02-52-07.results
hostname=fiotest-51, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.1, flags=1
<fiotest-51> seqwrite: (g=0): rw=rw, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=sync, iodepth=1
<fiotest-51> ...
<fiotest-51> Starting 12 processes
<fiotest-51> fio: pid=10120, err=5/file:backend.c:490, func=full resid, error=Input/output error
seqwrite: (groupid=0, jobs=12): err= 5 (file:backend.c:490, func=full resid, error=Input/output error): pid=10112: Tue Oct 23 02:57:40 2018
   read: IOPS=3, BW=14.6MiB/s (15.3MB/s)(4776MiB/327661msec)
    clat (msec): min=3, max=612, avg=89.31, stdev=69.07
     lat (msec): min=3, max=612, avg=89.32, stdev=69.07
    clat percentiles (msec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[   16], 20.00th=[   40],
     | 30.00th=[   53], 40.00th=[   64], 50.00th=[   75], 60.00th=[   90],
     | 70.00th=[  107], 80.00th=[  129], 90.00th=[  169], 95.00th=[  218],
     | 99.00th=[  347], 99.50th=[  380], 99.90th=[  542], 99.95th=[  617],
     | 99.99th=[  617]
   bw (  KiB/s): min= 6460, max=33098, per=61.81%, avg=9225.37, stdev=3190.43, samples=1060
   iops        : min=    1, max=    8, avg= 2.19, stdev= 0.80, samples=1060
  write: IOPS=30, BW=123MiB/s (129MB/s)(39.3GiB/327661msec)
    clat (msec): min=16, max=12690, avg=340.56, stdev=431.31
     lat (msec): min=17, max=12690, avg=340.88, stdev=431.31
    clat percentiles (msec):
     |  1.00th=[  129],  5.00th=[  169], 10.00th=[  182], 20.00th=[  211],
     | 30.00th=[  239], 40.00th=[  271], 50.00th=[  309], 60.00th=[  342],
     | 70.00th=[  376], 80.00th=[  418], 90.00th=[  489], 95.00th=[  567],
     | 99.00th=[  776], 99.50th=[  902], 99.90th=[12550], 99.95th=[12550],
     | 99.99th=[12684]
   bw (  KiB/s): min= 8175, max=84925, per=10.10%, avg=12720.69, stdev=4817.97, samples=6497
   iops        : min=    1, max=   20, avg= 3.05, stdev= 1.18, samples=6497
  lat (msec)   : 4=0.02%, 10=0.89%, 20=0.31%, 50=1.95%, 100=4.06%
  lat (msec)   : 250=32.55%, 500=52.28%, 750=6.83%, 1000=0.86%, 2000=0.07%
  lat (msec)   : >=2000=0.18%
  cpu          : usr=0.10%, sys=0.16%, ctx=11337, majf=0, minf=372
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=1195,10072,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=14.6MiB/s (15.3MB/s), 14.6MiB/s-14.6MiB/s (15.3MB/s-15.3MB/s), io=4776MiB (5008MB), run=327661-327661msec
  WRITE: bw=123MiB/s (129MB/s), 123MiB/s-123MiB/s (129MB/s-129MB/s), io=39.3GiB (42.2GB), run=327661-327661msec

Disk stats (read/write):
  sda: ios=10746/90769, merge=0/1, ticks=512715/18005113, in_queue=18516978, util=100.00%
<fiotest-51> 
client <10.70.56.51>: exited with error 1

Iteration 1 write total throughtput = 125952
Iteration 1 read total throughtput = 14950.4