fio/fio--large-file-90-pct-write-1-client-18-worker-2018-10-23-03-10-49.results
hostname=fiotest-51, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.1, flags=1
<fiotest-51> seqwrite: (g=0): rw=rw, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=sync, iodepth=1
<fiotest-51> ...
<fiotest-51> Starting 18 processes
<fiotest-51> fio: pid=10318, err=5/file:backend.c:490, func=full resid, error=Input/output error
seqwrite: (groupid=0, jobs=18): err= 5 (file:backend.c:490, func=full resid, error=Input/output error): pid=10310: Tue Oct 23 03:19:02 2018
   read: IOPS=3, BW=15.2MiB/s (15.0MB/s)(7416MiB/486269msec)
    clat (msec): min=3, max=7266, avg=154.26, stdev=200.89
     lat (msec): min=3, max=7266, avg=154.26, stdev=200.89
    clat percentiles (msec):
     |  1.00th=[   11],  5.00th=[   44], 10.00th=[   54], 20.00th=[   72],
     | 30.00th=[   87], 40.00th=[  104], 50.00th=[  122], 60.00th=[  142],
     | 70.00th=[  165], 80.00th=[  205], 90.00th=[  284], 95.00th=[  355],
     | 99.00th=[  575], 99.50th=[  751], 99.90th=[ 1116], 99.95th=[ 7282],
     | 99.99th=[ 7282]
   bw (  KiB/s): min= 6522, max=32899, per=56.91%, avg=8886.90, stdev=2634.93, samples=1693
   iops        : min=    1, max=    8, avg= 1.76, stdev= 0.81, samples=1693
  write: IOPS=31, BW=128MiB/s (134MB/s)(60.8GiB/486269msec)
    clat (msec): min=28, max=7774, avg=503.11, stdev=297.79
     lat (msec): min=28, max=7775, avg=503.42, stdev=297.79
    clat percentiles (msec):
     |  1.00th=[  163],  5.00th=[  251], 10.00th=[  288], 20.00th=[  347],
     | 30.00th=[  388], 40.00th=[  426], 50.00th=[  468], 60.00th=[  510],
     | 70.00th=[  558], 80.00th=[  625], 90.00th=[  735], 95.00th=[  852],
     | 99.00th=[ 1167], 99.50th=[ 1284], 99.90th=[ 7416], 99.95th=[ 7550],
     | 99.99th=[ 7752]
   bw (  KiB/s): min= 6522, max=71974, per=7.18%, avg=9407.10, stdev=3039.74, samples=13440
   iops        : min=    1, max=   17, avg= 1.88, stdev= 0.89, samples=13440
  lat (msec)   : 4=0.01%, 10=0.10%, 20=0.03%, 50=0.84%, 100=3.47%
  lat (msec)   : 250=9.25%, 500=48.60%, 750=29.37%, 1000=6.29%, 2000=1.94%
  lat (msec)   : >=2000=0.10%
  cpu          : usr=0.06%, sys=0.10%, ctx=17547, majf=0, minf=544
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=1855,15556,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=15.2MiB/s (15.0MB/s), 15.2MiB/s-15.2MiB/s (15.0MB/s-15.0MB/s), io=7416MiB (7776MB), run=486269-486269msec
  WRITE: bw=128MiB/s (134MB/s), 128MiB/s-128MiB/s (134MB/s-134MB/s), io=60.8GiB (65.2GB), run=486269-486269msec

Disk stats (read/write):
  sda: ios=16686/140197, merge=0/2, ticks=1535996/37974544, in_queue=39509257, util=100.00%
<fiotest-51> 
client <10.70.56.51>: exited with error 1

Iteration 1 write total throughtput = 131072
Iteration 1 read total throughtput = 15564.8